Repository: atlas-studios/Session2-G2
Catalog: omegat/project_save.tmx
Source language: zh_cn
Languages: en_us

source: 人体的平衡性非常重要，一个人重心不稳的时候会本能的慌乱，再强大的战力都无法施展。比如此刻江如龙整个人被江逸抡在半空转圈，他脑袋自然也慌乱眩晕起来。
en_us: A body's sense of balance was extremely important. When a person lost his center of gravity, he would instinctively fall into a state of panic and be unable to utilize any of his combat strength. Just like Jiang Rulong who was being whirled around by Jiang Yi, his mind naturally began to panic and fall in to a dazed state.

source: 人体的眼睛是最重要的器官之一，眼睛中的神经异常密集，一旦眼睛受伤武者战力绝对大打折扣，甚至完全失去战斗力。
en_us: The human eye was one of the most important organs in the human body. The nerves in the eyes were abnormally concentrated. Once the eyes were injured, any martial artist would definitely experience a great reduction in his or her combat ability, or even completely lose his or her fighting strength.

source: 人体神经最为密集的地方，一个是脑袋，另外一个就是下身！所以一直以来“撩阴腿”“猴子偷桃”这类招数虽然被人所不齿，但却是最实用的。
en_us: The brain and the crotch were the two areas where nerves were the most concentrated in the human body. Thus, even though techniques like "Leg to Provoke the Nether Regions" and "Monkey Stealing the Peach" had always been held in contempt, they were nonetheless moves that achieved the best results.

source: 人吓人，能吓死人！
en_us: When you want to be frightening, you might frighten somebody to death!

source: 人品中阶武技，蛇鞭腿！
en_us: Man-tier medial-grade martial art technique, Snake Whip Leg!

source: 人家出海是去猎兽，她这趟是种族入侵填海去了吧？你是精卫吗？
en_us: They were supposed to hunt for beasts but it seemed that she had been filling the sea with these creatures instead. Did she think she was Jing Wei? [1. Jingwei, a mythical bird trying to fill the sea with pebbles.]

source: 人数还不少，看上去有几百人。服装各异，修为更是从刚刚练气到元婴修士都有。而且个个身材壮实，神采奕奕，一个比一个精神，甚至还能见到衣下那隐隐跳动的肌肉。
en_us: There were a lot of them - the group of new disciples contained hundreds of people. They were dressed in a multitude of colours and their cultivation levels ranged from beginners to Nascent Soul. Each of them were of different body types but all of them looked equally strong - one could practically see the outline of their muscles which threatened to burst their sleeves.

source: 人渣！
en_us: Scumbags!

source: 人的丹田最好只运转一种元力，否则容易引发元力冲突絮乱，这是天星大陆人人皆知的常识，不过当江逸将通过无名口诀修炼出来的元力排出丹田，准备改练江水诀时，突然发现那缕新修炼出来的元力竟是黑色的？
en_us: It was common knowledge on Stellarsky Continent that one should only transfer of one type of essence force through the dantian, otherwise difference essence force could very easily clash and get mixed up. However, when Jiang Yi transferred the essence force produced from this nameless formula through his navel in preparation for practicing the Jiang Water Art instead, he quickly realised that the newly distilled essence force was black!

source: 人群中走出两个中年人，一个一身蓝袍，一个一身青色长衫，两人衣角都纹着三个铜钱的花样，满脸怒气的看着三人。青衣的手里拿着一个算盘，看起来还有点眼熟。
en_us: Among the strangers were two middle-aged men. One was in a blue robe while the other was in a green one. Both of their robes had a symbol of three coins. Their expressions were filled with rage as they stared at Lonemoon, Yi Qing and Shen Ying. The one in green pulled out an abacus. He looked familiar.

source: 人阶上品武技，劈山腿。
en_us: This was the Man-tier superior-grade martial arts technique, Mountain-Splitting Leg.

source: 人，还有人，真的还有人，太好了！
en_us: People, there's still people, that's great!

source: 亿万冥界大军每一个的心中都感到强烈震撼，那人虽然没有发出一丝威严强悍的气势，那人虽然看起来红光满面，剑眉星目，脸如刀削，但其实外表很老，白须飘飘，然而……那人带给他们的心灵震慑感，丝毫不亚于，甚至还要隐隐超过自己的主人，不死冥皇。
en_us: Every one of the hundreds of millions of Netherworld soldiers were astounded. Although he did not manifest an air of majestic might, he looked to be in good health. He had a chiseled face, ruddy cheeks, a long white beard, sword-like eyebrows, and star-like eyes. Despite the fact that he looked very old on the surface, he sent reverberations down their souls for he was in no way inferior to their master. It was even possible that he surpassed their master, the Undying Netherworld King.

source: 亿万年来，一向关得死死的魔界之门，第一次直接敞开，那边就是仙界。就是魔界这么多年来，一直想要进入，却碍这扇界门永远都去不了。偶有幸运的，也只是分出一两丝的神念，能从门缝中钻出去，或是靠着特殊的法子侵入而已。
en_us: For hundreds of millions of years, the Gates of Devildom, which has always been shut airtight, was opened wide for the first time. There, laid the World of the Immortals. For countless of years, the Devils have longed to breach the World of the Immortals, only to be denied by this Gate. The occasional lucky ones either only managed to enter through the cracks between the Gates or through special means.

source: 什么乱七八糟的，都够演上一部前世今生的电视剧了。
en_us: What a mess! This messy plot is enough to warrant a drama series on the television program!

source: 什么情况？为什么赢的人先哭上了？该哭的是那个被打的吧？
en_us: What was with this situation? Why was the winner crying first? Shouldn't the one who was beaten up be crying?

source: 什么情况？这……这些真的是妖吗？为什么见到她们，不攻击不说，反而越是高阶就越发的……客气？
en_us: What was this scenario? Were… were those really demons? Why did the demons not attack them and why was it that the higher their level, the more… courteous they became?

source: 什么都没有发生。
en_us: Nothing happened.

source: 什么鬼！
en_us: What the hell?

source: 什么鬼？这是……在录什么美食节目吗？为什么每次回来，她都能把身边所有人变成厨子啊喂？！
en_us: What is this? This… are we filming some gourmet program? How does she always manage to turn everyone around her into chefs each time she comes back?

source: 什么鬼？！
en_us: What the hell? !

source: 仇人见面，分外眼红！
en_us: When the two enemies spotted each other, they locked eyes in mutual fury.

source: 今天到底什么运气！易峰脸色瞬间惨白，连忙唤出了灵剑，死死的抓在手里，心惊肉跳的看着前方密密麻麻的灵兽群。
en_us: Today was not his lucky day! Yi Feng's face turned pale and he quickly summoned his spirit sword and gripped it tightly in his hand. Then he turned to face the dense waves of spirit beasts that were advancing towards them.

source: 今日给这马家公子一闹，他已经没有退路了，亦如在西山遭遇江如虎般，没有退路他唯有不退，杀出一条血路！
en_us: This fiasco caused by the Ma Family young master had left Jiang Yi with no other option. Yet, just like the time when he encountered Jiang Ruhu at the Western Hills, he would stand firm if there was no other way to turn; he would fight his way out and leave a blood path in his wake!

source: 从一刻钟前开始，他就在做梦，对！一定是梦！没有修士会把灵兽当成食物，就算有，也不可能专程跑到幻海来吃！
en_us: Everything that happened in the last minute was a dream. Yes! This must be a dream! No cultivator would treat spirit beasts as food. Even if they did, they would not come all the way to Mirage Sea to look for them!

source: 从昨天到现在，发生的事情太多太多了，让他脑袋都变成了一团浆糊，他摇头摇头，准备迟些疗伤后要好好理一理。
en_us: From yesterday until now, an overwhelming number of things had happened to the point that his brain had become a melted mess. He shook his head and prepared himself to fix himself mentally after healing his wounds.

source: 从此，曾经中青界的第一剑修孤月尊者，开始了他一边给人治病，一边教人练剑的完全老妈子生活。一时间原本冷清的无敌派，也热闹了起来，时不时可以看到有人挥剑的身影。
en_us: From then on, the once top Sword Cultivator of the Middle Azure World, Supremacy Lonemoon, began his journey of treating illnesses and teaching sword moves. It totally the life of a babysitter. Suddenly, the quiet Invincible Sect became more lively as the figures of people waving their swords could be spotted from time to time.

source: 从江家大院南门走了出来，江逸确定背后没人跟踪后，戴上斗篷直奔城中广场而去。小半个时辰后，他来到了广场东边一家很大的丹药店铺内。
en_us: Walking out from the south gate of the Jiang Residence, after confirming that no one was tailing him, he put on his cloak and ran non-stop all the way to the city plaza in the middle of the city. After an hour, he arrived at a large elixir store on the eastern side of the plaza.

source: 从绝世天才到废物，还连带让家族的最强供奉失踪，让江家实力大损。
en_us: The fate of Jiang Yi—from an incredible genius to a completely useless person who had directly caused the strongest member of the family clan to disappear—led to his reputation plummeting.

source: 从被抓到倒地，短短不过三息。
en_us: Not more than ten seconds had passed from the moment he was caught to the moment he landed.

source: 从西山回来和荣管事复命后，江逸溜出了江家大院，开始在城内转悠，寻找赚钱的办法。
en_us: Returning from the Western Hills and having reported to Chief Rong, Jiang Yi secretly slipped away from the Jiang Residence Central Courtyard and started wandering around the city in the search for ways to make more money.

source: 从这铸鼎境三重的武者冲进来，到现在被江逸踹出去，其实只是短短十几息时间。
en_us: Only a short duration of several seconds had passed, from the time the martial artist at the third stage of the Cast Tripod Realm rushed in, to the time Jiang Yi kicked him out.

source: 从马黑旗和柳河的目光中，他心里再次产生一种危机感。对于这种朝不保夕，时刻都可能被打死的日子他受够了，他很清楚要想过上安逸的日子，要想再也没人敢招惹自己，那唯有变强，变得比他们任何人都要强……
en_us: He had sensed danger from the way Ma Heiqi and Liu He looked at him. He had had enough of such a precarious life, in which he could be beaten to death at any moment. It became clear to him that in order to live a peaceful life that no one dared to disturb, the only way was to become strong, stronger than anyone could ever be...

source: 仔细检查了一遍，确保劫雷不会涉及无敌派，这才走向广场中的阵眼，正打算盘腿坐下渡劫，却还是忍不住回头警告道，“沈萤，飞升雷劫非同小可，你们不要靠……”
en_us: After checking that all measures had been taken to protect the Invincible Sect from the Lightning Tribulation, Lonemoon walked towards the eye of the array and sat down cross-legged to await the Tribulation Transcendence. However, he could not help turning around to issue a warning, "Shen Ying, the Lightning Tribulation of the Immortal Ascension is truly formidable, everyone don't come near..."

source: 他……是不是眼花了？
en_us: Was he… seeing things?

source: 他……没想回去啊？
en_us: He... doesn't want to go back?

source: 他一个五行废灵根，能平平安安到金丹大圆满，并在这么多魔头中保持一席之地，靠的就是他那超人的敏锐，总是能第一时间感觉到危险的来临。而就在刚刚戚橙雨旁边女子抓住他的瞬间。他感觉到了从未见过的恐怖杀气，那样铺天盖地，密不透风。一瞬间他只觉得整个脑海里只余下了一个字——死！
en_us: As someone with a Five Elements Maimed Spirit Root, he had always relied on his acute awareness and ability to sense imminent danger to safely perfect his Golden Core and maintain a position amongst all the fiendish cultivators. Yet, from the grasp of the girl who had been beside Qi Chengyu, he was able to sense a kind of frightening murderous intent he had never experienced before, the kind that was overwhelming and could not be escaped from. All he felt at that moment was — death!

source: 他一咬牙，当机立断直接唤出本命法器，一把三尺长的金剑，直接插着对方胸口飞了过去。
en_us: He gritted his teeth, and he made a sudden decision to summon his intrinsic Dharma artifact. A dagger, three feet long, pierced straight through the woman's chest.

source: 他一回头，却发现刚刚懒洋洋听情况沈萤已经不见了影踪。
en_us: He turned around and saw the lazy Shen Ying missing.

source: 他一夜没睡，天一亮匆匆吃了两个窝头就朝炼丹房跑去，昨日他忘记看《药草简录》了，万一今日柳长老要炼其他丹药，需要别的药草，他取药草的速度还是如此之慢，肯定会被训斥的。
en_us: He did not sleep for an entire night. Upon daybreak, he hastily ate two wotous before running in the direction of the alchemy lab. He had forgotten to read the "Record on Medicinal Herbs" yesterday. In the untimely event Elder Liu wanted to refine other medicinal elixirs and needed other medicinal herbs, should the speed at which he collected the required medicinal herbs still be extremely slow, he would definitely be scolded.

source: 他一开始让大家转剑修，除了给大家一个希望外，也是让她们以后遇到敌人的时候，能多个应对的手段。
en_us: He began by getting them to switch to Sword Cultivators. Apart from giving them hope, it was also to impart them another method to handle enemies in the future.

source: 他一时没注意，顿时脚下一重，单膝跪了下去，张口吐出一口血，完全没有抵御之力，这不是游仙的威压，这些人……
en_us: He lost focus for a moment and before he realised, his weight became too much for him to bear. He fell down on one knee and began to spit blood out of his mouth. He had no energy to defend himself at all. This suppressive force didnt come from traveling immortals, these people...

source: 他一脸的不敢置信，伸手想拿过萝卜叶子间的咸菜细看，却被萝卜一叶子抽开了爪子。
en_us: In disbelief, he stretched out a hand and tried to grab the pickle that was between the leaves of the radish to have a closer look, but claws emerged out of the radish's leaves.

source: 他一路而上，直到飞到阶梯的尽头，四周景致一换，他到了一片茂密的山林，耳边隐隐传来虫鸣鸟啼，连刚刚上来的阶梯都不见了。
en_us: He made his way up the stairs steadily until his surroundings changed. He reached a dense forest and heard the sound of insects and birds all around him. The stairs were gone.

source: 他七岁那年，家族照惯例调教年满七岁的子弟们修炼元力，其中还专门赐给江逸只有直系子弟才能修炼的人阶上品水系心法，“江水决”。
en_us: When they were seven, the clan typically taught descendants how to cultivate essence force, and the seven-year-old Jiang Yi was no exception. Jiang Yi was even specifically trained in the superior-grade Jiang Water Art, a Man-tier water-element technique usually taught only to direct bloodline descendants.

source: 他上前一步，话还没说完，那边发呆的人，却突然双目赤红的转过头来，满身的杀气迎面扑来。
en_us: He took a step forward but before he could finish his sentence, his opponent who had been in a daze suddenly turned around with bloodshot eyes and exuded a murderous intent as she pounced towards him.

source: 他上前几步，小心翼翼的把怀里的人，放在了易峰剑上，交代道，“护好她！”
en_us: He floated forward and carefully sat Shen Ying down on Yi Feng's sword. He instructed, "Protect her!"

source: 他下意识的摸了摸自己空荡荡的额心，主仆契约，主死仆从，主伤仆受，炮灰一样的契约。别说是高阶灵兽，就算一般灵兽都不会接受主仆契约。
en_us: He subconsciously felt his warm forehead. A master-servant contract: If the master dies, the servant follows; the master's injuries would be borne by the servant. It was a destructive contract that even low-level spirit beasts were unwiling to enter into, much less high-level ones like the green wyrm.

source: 他不就晚回来了一个时辰吗？这中间到底发生了什么？为什么好好的新弟子，一眨眼全变成厨子了。
en_us: Hadn’t he come back only two hours late? What had happened during this time? Why had all the new disciples turned into chefs in the blink of an eye?

source: 他不急不缓的拂了拂手中的剑道，“羿清那个妖女，早已经被我派人发的战贴引出去了。就连那个叫孤月的，此时怕是与其他人一起被锁入了升仙塔之中。我们既然敢闯进来，自然就做好了充足的准备。”
en_us: He calmly fiddled around with the Sword Dao in his hands and said, "That demoness Yi Qing has already been lured away with an invitation to a duel that I've asked someone to send earlier. Even that man, Lonemoon, has been locked away with the others in the Immortal Ascension Pagoda. Of course, the fact that we're here shows that we've done ample preparation."

source: 他不敢置信的喃喃一声，再次闭上眼睛内视了一遍又一遍，他的身体颤抖的越来越厉害，眼泪开始无声无息的从他眼角淌下，滑过他清秀的小脸，打湿了他的衣裳……
en_us: he muttered to himself in complete disbelief. Jiang Yi shut his eyes again and looked inward. He trembled more and more violently as tears silently trickled from the corners of his eyes, rolling down his delicate face and splattering onto his robes...

source: 他不禁一阵后怕，还好，还好发现及时。没想到一个魔修，居然牵扯出这么一大堆的事来。
en_us: A belated feeling of fear kicked in, but still, it was fortunate that he had discovered this in time. He hadn't expected this matter of the fiendish cultivator to bring so many other issues to light.

source: 他也是听说印风通知了她，才急忙赶过来的，就怕出事。好歹都是四大家族之一，想起自己家的教训，他便事先帮郁家求个情。
en_us: He heard that Yin Feng had informed her and hurried over in case something happened. They were fellow aristocratic families afterall. After what Xuan Yuanyu's family had been through, Xuan Yuanyu thought it appropriate to come down and plead onbehalf of the Yin Family.

source: 他五岁那年，和族里的其他孩子一样锻炼基础武技。那时候的他显露出惊人的武学悟性，各种复杂繁琐的基础招式一看便会，打得还有模有样，这让他一跃成为江家声名远播的天才童子。
en_us: At the tender age of five, Jiang Yi began basic training in martial arts, just like the other children in the family clan. Back then, he demonstrated astonishing prowess in martial arts; he was capable of learning and accurately replicating any technique with frightening ease, no matter how intricate or complex it was. It was this ability that instantly propelled him to fame, and people dubbed him “the Jiang Clan’s genius child”.

source: 他从小瓷瓶内取出一枚黄色的小药丸对着清水吞服下去，这是江家自己炼制的最低级的疗伤药，人阶下品，黄参丹。
en_us: He took out a new yellow tablet from the small porcelain vase and gulped it down with some water. This was the lowest-grade healing medicine the Jiang Clan refined and produced themselves—the Man-tier inferior-level product Yellow Ginseng Elixir.

source: 他从药材房内随便取了一些药粉就洒落进去，然后丢进去三枚废丹，等加温足够后再注入蓝色元力，最后一狠心注入了两缕黑色元力。
en_us: He retrieved some randomly-chosen medicinal powders from the ingredient storage room and sprinkled them into the cauldron, before throwing in the three useless elixir pills. After heating them to the right temperature, he injected blue essence force. Lastly, he callously injected two wisps of black essence force.

source: 他们一路到了主峰大殿，有弟子上了茶与灵果，沈萤眼睛这才亮了几分，专心吃起了果子。经过几个月猪食的摧残，连果子都芳香四溢起来。
en_us: After they arrived at the main peak's hall, Shen Ying's eyes finally brightened up a little only after some disciples served tea and spirit fruits. She concentrated on eating her fruits. After a few months of pig's feed, even fruits became a delicacy.

source: 他们举派飞升已经过去快半年了，可是除了郁红和思羽修为大涨，隐隐有仙骨生成的征兆。其它弟子的修为虽也有增涨，却因根基太浅，半点没有生成仙骨的迹象。
en_us: Even though it had already been close to a year since they advance to Immortal Ascension, but other than Yu Hong and Si Yu whose cultivation increased largely, with little signs of their immortal bones forming, the other disciples did not have such signs. Their cultivation levels merely increased, but because their foundation is too weak, there are totally no signs of their immortal bones forming.

source: 他们出来的那个缺口还在，但此时看过去却不是个缺口，而是一扇门，一个四六米高的练丹炉的门。
en_us: The opening they had come out from was still there, but now it was not a gap, but a door; measuring four by six meters, it was the door of an elixir-refining cauldron.

source: 他们到达城主府的时候，薄飞平已经在门口等着了。
en_us: When they arrived at the City Lord's household, Pu Feiping was already waiting for them at the door.

source: 他们午饭吃的是灵兽烤肉，不知道什么时候起，羿清已经养成了捡灵兽尸体的习惯，还就地取材用地上残余的红莲业火烤的。
en_us: They had roasted beast meat for lunch. Yi Qing had somehow learned how to inspect spirit beast corpses along the way. He picked up some materials from the surroundings and used the leftover flames from the Red Lotus Karmic Fire to roast the beast meat.

source: 他们去的地方并不远，就在镇子的东头，那边本是一片荒废的地方，野草丛生，只是中间有着一口枯井。
en_us: They were not far away, just at the east end of the town. It was originally an empty place, covered with wild grass, except for a dry well in the middle.

source: 他们又去了城中把那些仙气有异的地点，也通通看了一遍，也是同样的没有任何结果。
en_us: They then went to check out the places in the city that was said to be suspicious, but the results were still the same.

source: 他们又飞了几个小时，触目所及已经完全看不到石头以外的东西了，却没有发现任何异常。
en_us: They continued to sword-ride for a couple more hours. All around them, there was nothing but rocks. There didn't seem to be anything unusual either.

source: 他们在哪，刚刚都干了什么？
en_us: Where are we? What did we do?

source: 他们来之前……也就是说是那个魔族逃走的时候？他是直接逃回魔界，所以才消失得这么干净？
en_us: Before they came.. which means it was when the Demonic beast escaped? Was it because he directly escaped back to the Demon Realm, thus he could disappear without a trace?

source: 他们看到了什么？体……体修！女的！活着会喘气的那种。
en_us: What had they seen? A Body… Body Cultivator! A female one! One that was alive and kicking.

source: 他们能问一句，谁生的吗？
en_us: Are they allowed to know of the conceiving mother's identity?

source: 他们走过一看，果然是一个巨大的储物空间，灵气探进去都找不着边际，隐隐还能探到里面树木丛生，一眼看不到头的绿色。
en_us: They walked over and saw that it was indeed a huge storage compartment. Using their Spirit Qi to probe inside, they found that it was so vast that its boundaries could not be detected. However they could detect trees and shrubs inside and endless greenery.

source: 他们这一等，就等了近三个小时。天已经黑了，外面的喊价声才慢慢停歇，陆续有人离开。掌事带着他们到一个修士的面前。
en_us: They waited for nearly three hours. The sky had already turned dark, and the bidding voices gradually subsided as people began to leave. The steward brought them before a cultivator.

source: 他们这才看清，那全是一只只高阶灵兽，全部飘浮于魔蛟身后的海面上，像是一群灵兽大军一般，一眼看不到头。
en_us: Now they could see clearly that these creatures were all high level spirit beasts, and all of them were floating on the sea behind the Wyrm Demon, like a huge army of spirit beasts.

source: 他们这才看清，那是一座巨大的石峰，看起来比玄天宗的主峰都要大，只是整个石峰四周飘浮着各种古怪的法符，仿佛被层层阵法围绕其中。
en_us: It was at that moment that they saw it. It was a huge peak - even higher than the Main Peak of Blackheaven Sect. Surrounding the peak were different types of strange Dharmic talismans. It was as if there were layers of array formations surrounding the peak.

source: 他们这是修仙门派，不是修仙饭店啊喂！
en_us: This was an immortal cultivation sect, not an immortal cultivation restaurant!

source: 他们这是已经决定了吗？
en_us: So they have made up their minds?

source: 他们这是跟他一样，迷失了心智，被控制住了吗？这升仙塔到底是个什么东西？
en_us: Had they lost their consciousness like he did before? Were they now being controlled? What exactly is this pagoda doing to people?

source: 他们需要时间调息。
en_us: They needed tme to rest.

source: 他佯装打扫炼丹房，等了一会见柳长老没有回来，利马动手了。取出三枚丹药丢进一个小丹炉内学着用黑石加温，等了一会才缓缓注入蓝色元力，并且通过元力感应丹炉内的情况。
en_us: He pretended to clean up the alchemy lab. After waiting for some time, and seeing that Elder Liu had not returned, he immediately took action. He retrieved three elixir pills and threw them into a small cauldron, before copying Elder Liu by heating up the small cauldron with coal. He slowly injected blue essence force after waiting for a while and, through this essence force, sensed the conditions in the cauldron.

source: 他倒出一粒丹药，放开神识一探，果然发现丹中萦绕着一股若隐若现的黑气。
en_us: Lonemoon poured out an elixir pill from a bottle and probed it with his perception aura. As expected, he found an obscure black Qi surrounding it.

source: 他倔强地高扬着他那隐隐觉得越来越沉重的头，无视旁人怪异的眼神，一步一挨、一瘸一拐地往家里走。一路上巨大的疼痛让他原本清秀稚嫩的脸庞痛得无比扭曲，眼中满是怨恨……
en_us: Despite feeling even more lightheaded, he stubbornly kept his head held up high. Step by step, Jiang Yi limped back home, ignoring his surroundings. All throughout the long, painful journey, his dark eyes smoldered with fire and fury, and the immense agony left his delicate, supple face distorted in a frightening grimace.

source: 他全身一颤，脑海顿时升起一个硕大的死字，四身冷汗哗啦啦的流了出来。
en_us: His entire body stilled. Thoughts of death filled his mind as he began to break out in cold sweat.

source: 他内心一阵激动，只见羿清的剑招再换，右手猛的举起，神情肃穆气势如虹的高吼一声，“破！”那把巨剑顿时直挺挺的砸了下来，轰隆一声直接把眼前的山洞劈成了两半。巨剑却没有停下，反而换着各种方向，侧切竖切斜切，像是切菜般，一下……一下……又一下……
en_us: Lonemoon's heart leaped in excitement. He saw that Yi Qing was changing his sword move. Lifting his right hand, a solemn expression on his face, Yi Qing let out a formidable roar, "Break!" The gigantic sword immediately slammed itself down directly onto the cave. There was a loud bang and the cave in front of them was sliced in two. The giant sword did not stop here, but instead attacked in different directions; making a side chop, a vertical chop, an oblique chop, like chopping vegetables, one here.. another there… yet another…

source: 他内心暗暗叫苦，虽然对方认出他是江家的子弟，今日绝对不敢打死他的。但这事要是闹开了，被家族刑堂知道了，他被责罚一顿是小事，小奴败坏家族声誉怕是要被活活打死啊……
en_us: He grumbled bitterly in his mind. Although the housekeeper recognized that he was a member of the Jiang Clan and was certainly didn't dare to beat him to death; however, should the incident that day get publicized, and should the Jiang Clan Disciplinary Court find out... It was a small matter for him to get punished, but he was afraid that Xiaonu would be beaten to death for damaging the family's reputation...

source: 他内心沉喝一声，下意识的去调集黑色元力，让他震愕的是，一缕黑色元力瞬间从丹田内运转出来，流转到经脉。
en_us: he shouted loudly in his heart, setting his mind to summon and assemble his black essence forces. What left him excited and bewildered was that a wisp of black essence force circulated out of his dantian in an instant, and flowed towards his meridians.

source: 他内视了一下伤口，心情很快多云转晴。就这么一点时间，伤口恢复的速度已经赶上了他打坐运功疗伤两三个时辰了。如果此刻有足够的黑色元力，估计半炷香时间就能把伤势恢复个七七八八……
en_us: He used his inner vision to check on his wound and his emotions quickly improved. In such a short amount of time, the wound-recovery speed had already overtaken the amount he had healed through meditation by four to six hours. If at that moment he had enough black essence force, he estimated that within two and half minutes he would be able to heal his wounds by seventy to eighty percent...

source: 他再次奔走了数十丈距离，速度一下慢了下来，那黑色元力已经消耗完毕了，他刚想调动一丝黑色元力，继续加快速度却很快醒悟过来。
en_us: after running a few hundred feet, his speed rapidly dropped. The black essence force was exhausted. He wanted to use another wisp of the black essence force to boost his speed again, but he came to his senses quickly.
